dbaeumer.vscode-eslint
digitalbrainstem.javascript-ejs-support
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
gruntfuggly.todo-tree
humao.rest-client
mechatroner.rainbow-csv
meteorstudio.cursorcode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode.live-server
nrwl.angular-console
rangav.vscode-thunder-client
redhat.java
ritwickdey.liveserver
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wakatime.vscode-wakatime
zxh404.vscode-proto3
